# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8        80*80
  - [36,75, 76,55, 72,146]  # P4/16       40*40
  - [142,110, 192,243, 459,401]  # P5/32     20*20

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
    [ -1, 1, ResNet181, [ 128 ] ],  # 0     80*80
    [ -1, 1, ResNet182, [ 256 ] ],  # 1      40*40
    [ -1, 1, ResNet183, [ 512 ] ],  # 2      20*20
    [ -1, 1, SPPF, [ 1024, 5 ] ],  # 3
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 4

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [1, 1, Conv, [256, 1, 1]], # route backbone P4         上采样 40*40
   [0, 1, Conv, [256, 3, 2]], #8 p2下采样1
   [-1, 1, Conv, [512, 3, 2]], #9 p2下采样2
   [1, 1, Conv, [512, 3, 2]], #10 p3下采样1
   [[-3, -4, -5], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 19

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], #22
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #23 上采样
   [1, 1, Conv, [128, 1, 1]], #24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #25  上采样
   [0, 1, Conv, [128, 1, 1]], # route backbone P3           上采样 80*80
   [[-1, -2, -4, -6], 1, Concat, [1]], #27

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 35

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]], #39
   [-1, 1, Conv, [512, 3, 2]], # 40 下采样
   [19, 1, Conv, [512, 3, 2]], # 41 下采样
   [[-3, -5, 19], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]], #49
   [-1, 1, BottleneckCSP2_imbgfg, [256, 1, 1]], # 50

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]], #54
   [[-1, -3, 4, 40, 41, 9, 10], 1, Concat, [1]],

   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 63

   [35, 1, RepConv, [256, 3, 1]],
   [50, 1, RepConv, [512, 3, 1]],
   [63, 1, RepConv, [1024, 3, 1]],

   [[64,65,66], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
